// Copyright (c) 1997-2010 Nokia Corporation and/or its subsidiary(-ies).
// All rights reserved.
// This component and the accompanying materials are made available
// under the terms of "Eclipse Public License v1.0"
// which accompanies this distribution, and is available
// at the URL "http://www.eclipse.org/legal/epl-v10.html".
//
// Initial Contributors:
// Nokia Corporation - initial contribution.
//
// Contributors:
//
// Description:
// This is a unicode-encoded data file which contains hindi character codes.

[ColorSettings]
ScreenModeEnums=13, 12, 11, 8, 7, 6, 4,
HiddenScreenModeEnums=7,

[PixelFormats]
SourcePixelFormatEnums=EUidPixelFormatARGB_8888_PRE, EUidPixelFormatARGB_8888, EUidPixelFormatRGB_565
TargetPixelFormatEnums=EUidPixelFormatARGB_8888_PRE, EUidPixelFormatARGB_8888, EUidPixelFormatRGB_565

[SanityCheck]
Bitmaps=false

[Profiling]
DoProfiling=0

[AlphaDrawingTests]
testCreateWindowAlpha=1	
testDrawOpaqueWindow=1	
testDrawTransparentFactorWindow=1
testDrawTransparentWindowPerPixel=1	
testDrawTransparentWindowPerPixelAlpha=1

[OutLineShadowTests-0001]
fontTypeFace=DejaVu Sans Condensed
[OutLineShadowTests-0002]
fontTypeFace=DejaVu Sans Mono
[OutLineShadowTests-0003]
fontTypeFace=DejaVu Serif Condensed

[GlyphDataSampleText]
LatinLong = If it were done when 'tis done, then 'twere well It were done quickly: if the assassination Could trammel up the consequence, and catch With his surcease success; that but this blow Might be the be-all and the end-all here, But here, upon this bank and shoal of time, We'ld jump the life to come. But in these cases We still have judgment here; that we but teach Bloody instructions, which, being taught, return To plague the inventor: this even-handed justice Commends the ingredients of our poison'd chalice To our own lips. He's here in double trust; First, as I am his kinsman and his subject, Strong both against the deed; then, as his host, Who should against his murderer shut the door, Not bear the knife myself. Besides, this Duncan Hath borne his faculties so meek, hath been So clear in his great office, that his virtues Will plead like angels, trumpet-tongued, against The deep damnation of his taking-off; And pity, like a naked new-born babe, Striding the blast, or heaven's cherubim, horsed Upon the sightless couriers of the air, Shall blow the horrid deed in every eye, That tears shall drown the wind. I have no spur To prick the sides of my intent, but only Vaulting ambition, which o'erleaps itself And falls on the other.
LatinShort = Calculator
HindiLong = पाषाण युग भीमबेटका मध्य प्रदेश की गुफाएँ भारत में मानव जीवन का प्राचीनतम प्रमाण है। प्रथम स्थाई बस्तियों ने ९००० वर्ष पूर्व स्वरुप लिया। यही आगे चल कर सिन्धु घाटी सभ्यता में विकसित हुई, जो २६०० ईसापूर्व और १९०० ईसापूर्व के मध्य अपने चरम पर थी। [३] लगभग १६०० ईसापूर्व आर्य भारत आए और उत्तर भारतीय क्षेत्रों में वैदिक सभ्यता का सूत्रपात किया। इस सभ्यता के स्रोत वेद और पुराण हैं। यह परम्परा कई सहस्र वर्ष पुरानी है। इसी समय दक्षिण बारत में द्रविड़ सभ्यता का विकास होता रहा। दोनों जातियों ने एक दूसरे की खूबियों को अपनाते हुए भारत में एक मिश्रित संस्कृति का निर्माण किया। ५०० ईसवी पूर्व कॆ बाद, कई स्वतंत्र राज्य बन गए। उत्तर में मौर्य राजवंश, जिसमें बौद्ध महाराजा अशोक सम्मिलित थे, ने भारत के सांस्कृतिक पटल पर उल्लेखनीय छाप छोड़ी।[४] १८० ईसवी के आरम्भ से, मध्य एशिया से कई आक्रमण हुए, जिनके परिणामस्वरूप उत्तरी भारतीय उपमहाद्वीप में यूनानी, शक, पार्थी और अंततः कुषाण राजवंश स्थापित हुए| तीसरी शताब्दी के आगे का समय जब भारत पर गुप्त वंश का शासन था, भारत का "स्वर्णिम काल" कहलाया। "[५][६] तीसरी शताब्दी में सम्राट अशोक द्वारा बनाया गया मध्य प्रदेश में साँची का स्तूप दक्षिण भारत में भिन्न-भिन्न समयकाल में कई राजवंश चालुक्य, चेर, चोल, पल्लव तथा पांड्य चले । ईसा के आसपास संगम साहित्य अपने चरम पर था जिसमें तमिळ भाषा का परिवर्धन हुआ । सातवाहनों और चालुक्यों ने मध्य भारत में अपना वर्चस्व स्थापित किया । विज्ञान, कला, साहित्य, गणित, खगोल शास्त्र, प्राचीन प्रौद्योगिकी, धर्म, तथा दर्शन इन्हीं राजाओं के शासनकाल में फ़ले-फ़ूले । १२वीं शताब्दी के प्रारंभ में, भारत पर इस्लामी आक्रमणों के पश्चात, उत्तरी व केन्द्रीय भारत का अधिकांश भाग दिल्ली सल्तनत के शासनाधीन हो गया; और बाद में, अधिकांश उपमहाद्वीप मुगल वंश के अधीन। दक्षिण भारत में विजयनगर साम्राज्य शक्तिशाली निकला। हालाँकि, विशेषतः तुलनात्मक रूप से, संरक्षित दक्षिण में अनेक राज्य शेष रहे अथवा अस्तित्व में आये। मुगलों के संक्षिप्त अधिकार के बाद सत्रहवीं सदी में दक्षिण और मध्य भारत में मराठों का उत्कर्ष हुआ। उत्तर पश्चिम में सिक्खों की शक्ति में वृद्धि हुई। १७वीं शताब्दी के मध्यकाल में पुर्तगाल, डच, फ्रांस, ब्रिटेन सहित अनेकों यूरोपीय देशों, जो भारत से व्यापार करने के इच्छुक थे, उन्होनें देश की शासकीय अराजकता का लाभ प्राप्त किया। अंग्रेज दूसरे देशों से व्यापार के इच्छुक लोगों को रोकने में सफल रहे और १८४० तक लगभग संपूर्ण देश पर शासन करने में सफल हुए। १८५७ में ब्रिटिश इस्ट इंडिया कम्पनी के विरुद्ध असफल विद्रोह, जो कि भारतीय स्वतन्त्रता के प्रथम संग्राम से जाना जाता है, के बाद भारत का अधिकांश भाग सीधे अंग्रेजी शासन के प्रशासनिक नियंत्रण में आ गया। [७] कोणार्क चक्र - १३वीं शताब्दी में बने उड़ीसा के सूर्य मन्दिर में स्थित, यह दुनिया के सब से प्रसिद्घ ऐतिहासिक स्थानों में से एक है। बीसवी सदी के प्रारम्भ मे आधुनिक शिक्षा के प्रसार और विश्वपटल पर बदलती राजनीतिक परिस्थितियो के चलते भारत मे एक बौद्धिक आन्दोलन का सूत्रपात हुआ जिसने सामाजिक और राजनीतिक स्तरो पर अनेक परिवर्तनों एवम आन्दोलनो की नीव रखी। १८८५ मे काँग्रेस पार्टी की स्थापना ने स्वतन्त्रता आन्दोलन को एक औपचारिक स्वरूप दिया। बीसवीं शताब्दी के प्रारंभ में एक लम्बे समय तक स्वतंत्रता प्राप्ति के लिये विशाल अहिंसावादी संघर्ष चला, जिसका नेतृत्‍व महात्मा गांधी, जो कि आधिकारिक रुप से आधुनिक भारत के राष्ट्रपिता से संबोधित किये जाते हैं, ने किया। इसके साथ-साथ चंद्रशेखर आजाद, सरदार भगत सिंह, सुख देव, राजगुरू, नेताजी सुभाष चन्द्र बोस आदि के नेतृत्‍व मे चले क्रांतिकारी संघर्ष के फलस्वरुप १५ अगस्त, १९४७ भारत ने अंग्रेजी शासन से पूर्णतः स्वतंत्रता प्राप्त की। तदुपरान्त २६ जनवरी, १९५० को भारत एक गणराज्य बना। एक बहुजातीय तथा बहुधार्मिक राष्ट्र होने के कारण भारत को समय-समय पर साम्प्रदायिक तथा जातीय विद्वेष का शिकार होना पड़ा है। क्षेत्रीय असंतोष तथा विद्रोह भी हालाँकि देश के अलग-अलग हिस्सों में होते रहे हैं, पर इसकी धर्मनिरपेक्षता तथा जनतांत्रिकता, केवल १९७५-७७ को छोड़, जब तत्कालीन प्रधानमंत्री इंदिरा गांधी ने आपातकाल की घोषणा कर दी थी, अक्षुण्ण रही है।भारत के पड़ोसी राष्ट्रों के साथ अनसुलझे सीमा विवाद हैं। इसके कारण इसे छोटे पैमानों पर युद्ध का भी सामना करना पड़ा है। १९६२ में चीन के साथ, तथा १९४७, १९६५, १९७१ एवम् १९९९ में पाकिस्तान के साथ लड़ाइयाँ हो चुकी हैं। भारत गुटनिरपेक्ष आन्दोलन तथा संयुक्त राष्ट्र संघ के संस्थापक सदस्य देशों में से एक है। १९७४ में भारत ने अपना पहला परमाणु परीक्षण किया था जिसके बाद १९९८ में ५ और परीक्षण किये गये। १९९० के दशक में किये गये आर्थिक सुधारीकरण की बदौलत आज देश सबसे तेज़ी से विकासशील राष्ट्रों की सूची में आ गया है।
HindiShort = कल्कुलैटर